const kleague = {
	years: {max: 2018, min: 2013},
	leagues: ['K League 1', 'K League 2'],
	seasons: {
		'K League 1': {
			teams: {
				2018: [
				'전북', '제주', '수원', '울산', '서울', '강원',
				'포항', '대구', '인천', '전남', '상주', '경남',
				],
				2017: [
				'서울', '전북', '제주', '울산', '전남', '상주',
				'수원', '광주', '포항', '인천', '대구', '강원',
				],
				2016: [
				'전북', '수원', '포항', '서울', '성남', '제주',
				'울산', '인천', '전남', '광주', '상주', '수원FC',
				],
				2015: [
				'전북', '수원', '서울', '포항', '제주', '울산',
				'전남', '부산', '성남', '인천', '대전', '광주',
				],
				2014: [
				'포항', '울산', '전북', '서울', '수원', '부산',
				'인천', '성남', '제주', '전남', '경남', '상주',
				],
				2013: [
				'서울', '전북', '포항', '수원', '울산', '제주', '부산',
				'경남', '인천', '대구', '전남', '성남', '대전', '강원',
				]
			},
		},
		'K League 2': {
			teams: {
				2018: [
					'광주', '부산', '아산', '성남', '부천',
					'수원FC', '안양', '서울E', '안산', '대전',
				],
				2017: [
					'성남', '수원FC', '아산', '부천', '부산',
					'서울E', '대전', '경남', '안양', '안산',
				],
				2016: [
					'부산', '대전', '대구', '서울E', '부천',
					'안양', '강원', '고양', '경남', '아산', '충주',
				],
				2015: [
					'경남', '상주', '아산', '강원', '안양',
					'수원FC', '대구', '고양', '충주', '부천', '서울E',
				],
				2014: [
					'강원', '대구', '대전', '아산', '광주',
					'수원FC', '안양', '고양', '부천', '충주',
				],
				2013: [
					'상주', '아산', '광주', '수원FC',
					'안양', '고양', '부천', '충주',
				]
			},
		}
	}
};

export default kleague;
